In [2]:
# Import the required libraries for the project
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [3]:
# USing the url of world population review as reference
url = "https://worldpopulationreview.com/country-rankings/life-expectancy-by-country"
url

'https://worldpopulationreview.com/country-rankings/life-expectancy-by-country'

In [4]:
# Using the request library to read url if the response shows 200 then its available and if it shows 400 then its unavailable
response = requests.get(url)
response

In [5]:
# Use beautiful soup to display correct formats
soup = BeautifulSoup(response.text, "html.parser")

In [6]:
# First find all tables in the url
table = soup.find("table", class_ = "wpr-table min-w-full border-collapse")

In [7]:
# th has all the column names
column_names = soup.find_all("th")

In [23]:
column_names

[<th class="datatable-th border-wpr-table_border bg-wpr-table_header_bg text-wpr-table_header sticky top-0 z-40 border-none py-2 leading-4 w-12 px-2 text-center"><div class="flex cursor-pointer items-center select-none justify-center"><span class="sort-indicator ml-1"></span></div></th>,
 <th class="datatable-th border-wpr-table_border bg-wpr-table_header_bg text-wpr-table_header sticky top-0 z-40 border-none py-2 leading-4 px-3 text-left md:px-4"><div class="flex cursor-pointer items-center select-none">Country<span class="sort-indicator ml-1"></span></div></th>,
 <th class="datatable-th border-wpr-table_border bg-wpr-table_header_bg text-wpr-table_header sticky top-0 z-40 border-none py-2 leading-4 px-3 text-left md:px-4"><div class="flex cursor-pointer items-center select-none">Life Expectancy UN<!-- --> 2024<span class="sort-indicator ml-1">â</span></div></th>,
 <th class="datatable-th border-wpr-table_border bg-wpr-table_header_bg text-wpr-table_header sticky top-0 z-40 border-none py-2 leading-4 px-3 text-left md:px-4"><div class="flex cursor-pointer items-center select-none">Female Life Expectancy UN<!-- --> 2024<span class="sort-indicator ml-1"></span></div></th>,
 <th class="datatable-th border-wpr-table_border bg-wpr-table_header_bg text-wpr-table_header sticky top-0 z-40 border-none py-2 leading-4 px-3 text-left md:px-4"><div class="flex cursor-pointer items-center select-none">Male Life Expectancy UN<!-- --> 2024<span class="sort-indicator ml-1"></span></div></th>]

In [8]:
# Print all the column names
column_names_title = [title.text for title in column_names]
column_names_title

['',
 'Country',
 'Life Expectancy UN 2024â\x86\x93',
 'Female Life Expectancy UN 2024',
 'Male Life Expectancy UN 2024']

In [9]:
# Cleaning unwanted words from column
column_names_title = [
    col.replace("â\x86\x93", "").strip()
    for col in column_names_title
]
column_names_title

['',
 'Country',
 'Life Expectancy UN 2024',
 'Female Life Expectancy UN 2024',
 'Male Life Expectancy UN 2024']

In [10]:
# Find all row values in column
column_data = table.find_all("tr")

In [11]:
# Empty list to append row values
all_rows = []

# Using loop formula to find row data from td
for data in column_data:
    row_data = data.find_all("td")
    individual_row_data = [row.text for row in row_data]
    all_rows.append(individual_row_data)

In [12]:
# Create the data frame and append rows in column 
df = pd.DataFrame(all_rows, columns=column_names_title)
df

,,Country,Life Expectancy UN 2024,Female Life Expectancy UN 2024,Male Life Expectancy UN 2024
0,None,None,None,None,None
1,,Monaco,86.50,88.63,84.56
2,,San Marino,85.82,87.22,84.32
3,,Hong Kong,85.63,88.26,82.97
4,,Japan,84.85,87.88,81.83
...,...,...,...,...,...
228,,Lesotho,57.80,60.44,55.03
229,,South Sudan,57.74,60.75,54.76
230,,Central African Republic,57.67,59.56,55.51
231,,Chad,55.24,57.19,53.36
232,,Nigeria,54.63,54.94,54.33

In [13]:
# Drop any useless row
df = df.drop(df[df['Country'].isna()].index).reset_index(drop=True)
df

,,Country,Life Expectancy UN 2024,Female Life Expectancy UN 2024,Male Life Expectancy UN 2024
0,,Monaco,86.50,88.63,84.56
1,,San Marino,85.82,87.22,84.32
2,,Hong Kong,85.63,88.26,82.97
3,,Japan,84.85,87.88,81.83
4,,South Korea,84.43,87.28,81.32
...,...,...,...,...,...
227,,Lesotho,57.80,60.44,55.03
228,,South Sudan,57.74,60.75,54.76
229,,Central African Republic,57.67,59.56,55.51
230,,Chad,55.24,57.19,53.36
231,,Nigeria,54.63,54.94,54.33

In [14]:
# Check the column data 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232 entries, 0 to 231
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0                                   232 non-null    object
 1   Country                         232 non-null    object
 2   Life Expectancy UN 2024         232 non-null    object
 3   Female Life Expectancy UN 2024  232 non-null    object
 4   Male Life Expectancy UN 2024    232 non-null    object
dtypes: object(5)
memory usage: 9.2+ KB

In [15]:
#Drop the useless column
df = df.drop(columns=[''])
df

,Country,Life Expectancy UN 2024,Female Life Expectancy UN 2024,Male Life Expectancy UN 2024
0,Monaco,86.50,88.63,84.56
1,San Marino,85.82,87.22,84.32
2,Hong Kong,85.63,88.26,82.97
3,Japan,84.85,87.88,81.83
4,South Korea,84.43,87.28,81.32
...,...,...,...,...
227,Lesotho,57.80,60.44,55.03
228,South Sudan,57.74,60.75,54.76
229,Central African Republic,57.67,59.56,55.51
230,Chad,55.24,57.19,53.36
231,Nigeria,54.63,54.94,54.33

In [16]:
# Display countries with highest life expectancy
df.head()

,Country,Life Expectancy UN 2024,Female Life Expectancy UN 2024,Male Life Expectancy UN 2024
0,Monaco,86.50,88.63,84.56
1,San Marino,85.82,87.22,84.32
2,Hong Kong,85.63,88.26,82.97
3,Japan,84.85,87.88,81.83
4,South Korea,84.43,87.28,81.32

In [17]:
df.tail()

,Country,Life Expectancy UN 2024,Female Life Expectancy UN 2024,Male Life Expectancy UN 2024
227,Lesotho,57.80,60.44,55.03
228,South Sudan,57.74,60.75,54.76
229,Central African Republic,57.67,59.56,55.51
230,Chad,55.24,57.19,53.36
231,Nigeria,54.63,54.94,54.33

In [18]:
# Display countries with lowest life expectancy
df.describe()

,Country,Life Expectancy UN 2024,Female Life Expectancy UN 2024,Male Life Expectancy UN 2024
count,232,232,232,232
unique,232,218,218,219
top,Monaco,76.94,76.66,60.49
freq,1,2,4,3

In [19]:
# Check for any empty values
df.isnull().sum()

Country                           0
Life Expectancy UN 2024           0
Female Life Expectancy UN 2024    0
Male Life Expectancy UN 2024      0
dtype: int64

In [20]:
df['Life Expectancy UN 2024'] = df['Life Expectancy UN 2024'].astype(float)
df['Female Life Expectancy UN 2024'] = df['Female Life Expectancy UN 2024'].astype(float)
df['Male Life Expectancy UN 2024'] = df['Male Life Expectancy UN 2024'].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232 entries, 0 to 231
Data columns (total 4 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Country                         232 non-null    object
 1   Life Expectancy UN 2024         232 non-null    float64
 2   Female Life Expectancy UN 2024  232 non-null    float64
 3   Male Life Expectancy UN 2024    232 non-null    float64
dtypes: float64(3), object(1)
memory usage: 7.4+ KB

In [21]:
# Check for any duplicate values
df.duplicated().sum()

np.int64(0)

In [22]:
# Display all unique values in table
df['Country'].unique()

array(['Monaco', 'San Marino', 'Hong Kong', 'Japan', 'South Korea',
       'Saint Barthelemy', 'French Polynesia', 'Andorra', 'Switzerland',
       'Australia', 'Italy', 'Singapore', 'Spain', 'Liechtenstein',
       'Reunion', 'Gibraltar', 'Malta', 'France', 'Norway', 'Sweden',
       'Guernsey', 'Macau', 'Vatican City', 'United Arab Emirates',
       'Iceland', 'Martinique', 'Israel', 'Canada', 'Ireland', 'Portugal',
       'Qatar', 'Bermuda', 'Luxembourg', 'Netherlands', 'Belgium',
       'New Zealand', 'Guadeloupe', 'Austria', 'Denmark', 'Finland',
       'Greece', 'Puerto Rico', 'Cyprus', 'Slovenia', 'Germany',
       'United Kingdom', 'Bahrain', 'Chile', 'Maldives', 'Isle of Man',
       'Costa Rica', 'Kuwait', 'Cayman Islands', 'Saint Martin',
       'Faroe Islands', 'Oman', 'Czechia', 'Jersey', 'Albania', 'Panama',
       'Anguilla', 'United States', 'Falkland Islands', 'Estonia',
       'Saudi Arabia', 'Northern Mariana Islands', 'New Caledonia',
       'Poland', 'Croatia', 'Slovakia', 'Uruguay', 'Cuba',
       'Turks and Caicos Islands', 'Bosnia and Herzegovina', 'China',
       'Jordan', 'Lebanon', 'Peru', 'Colombia', 'Iran',
       'Antigua and Barbuda', 'Sri Lanka', 'Ecuador', 'Argentina',
       'North Macedonia', 'British Virgin Islands', 'Turkey', 'Guam',
       'Montenegro', 'Hungary', 'French Guiana', 'Tokelau', 'Curacao',
       'Serbia', 'Saint Pierre and Miquelon', 'Malaysia', 'Tunisia',
       'Thailand', 'Sint Maarten', 'Aruba', 'Algeria', 'Montserrat',
       'Latvia', 'Barbados', 'Mayotte', 'Cape Verde', 'Lithuania',
       'Romania', 'Brazil', 'Armenia', 'Bulgaria',
       'United States Virgin Islands', 'Brunei', 'Morocco',
       'Cook Islands', 'Grenada', 'Mexico', 'Nicaragua', 'Mauritius',
       'Bangladesh', 'Vietnam', 'Bahamas', 'Ukraine', 'Georgia',
       'Belarus', 'Azerbaijan', 'Kazakhstan', 'Paraguay',
       'Dominican Republic', 'Suriname', 'North Korea', 'Belize',
       'Trinidad and Tobago', 'Russia', 'Bhutan', 'Tonga', 'Honduras',
       'Seychelles', 'American Samoa', 'Saint Lucia', 'Guatemala',
       'Venezuela', 'Syria', 'Uzbekistan', 'Iraq', 'El Salvador',
       'Saint Kitts and Nevis', 'India', 'Mongolia', 'Tajikistan',
       'Samoa', 'Kyrgyzstan', 'Egypt', 'Vanuatu', 'Jamaica',
       'Western Sahara', 'Saint Vincent and the Grenadines', 'Moldova',
       'Indonesia', 'Dominica', 'Libya', 'Cambodia', 'Solomon Islands',
       'Nepal', 'Guyana', 'Turkmenistan', 'Greenland', 'Niue',
       'Philippines', 'Sao Tome and Principe', 'Yemen', 'Palau',
       'Botswana', 'Laos', 'Palestine', 'Senegal', 'Eritrea', 'Bolivia',
       'Mauritania', 'Gabon', 'Uganda', 'Rwanda', 'Timor-Leste',
       'Pakistan', 'Ethiopia', 'Malawi', 'Namibia', 'Fiji', 'Micronesia',
       'Tuvalu', 'Tanzania', 'Myanmar', 'Marshall Islands', 'Comoros',
       'Kiribati', 'Zambia', 'Sudan', 'South Africa', 'Afghanistan',
       'Papua New Guinea', 'Djibouti', 'Gambia', 'Republic of the Congo',
       'Ghana', 'Haiti', 'Angola', 'Eswatini', 'Guinea-Bissau',
       'Cameroon', 'Equatorial Guinea', 'Kenya', 'Madagascar', 'Burundi',
       'Mozambique', 'Zimbabwe', 'Togo', 'Liberia', 'Nauru',
       'Ivory Coast', 'DR Congo', 'Sierra Leone', 'Niger', 'Burkina Faso',
       'Benin', 'Guinea', 'Mali', 'Somalia', 'Lesotho', 'South Sudan',
       'Central African Republic', 'Chad', 'Nigeria'], dtype=object)

In [ ]:
# Save the csv file for further process
df.to_csv("/Users/akishabhujel/Desktop/world_life_expectancy_2024.csv", index=False, encoding="utf-8")